app/views/merchants/index.html.erb

SELECT COUNT(*) FROM `deals` WHERE `deals`.`merchant_id` = 1
---
    <h2><%= link_to merchant.name, merchant %></h2>
    Deals: <%= merchant.deals.size %>