app/controllers/api/v1/deal_controller.rb

  def index
    deals = Deal.all
---
SELECT `deals`.* FROM `deals`