app/controllers/api/v1/merchant_controller.rb

SELECT `merchants`.* FROM `merchants`
---
  def index
    merchants = Merchant.all