app/controllers/api/v1/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email_address` = 'ragupta@gmail.com' AND `users`.`password` = 'pass' LIMIT 1
---
  def login
    if params[:email_address].present? && params[:password].present?
      user = User.find_by_email_address_and_password(params[:email_address], params[:password])

SELECT `users`.* FROM `users` WHERE `users`.`email_address` = 'ragupta@gmail.com' LIMIT 1
---
  def logout
    if params[:email_address].present?
      user = User.find_by_email_address(params[:email_address])

SELECT `users`.* FROM `users` WHERE `users`.`email_address` = 'ragupta@gmail.com' LIMIT 1
SELECT `user_subscribers`.* FROM `user_subscribers` WHERE `user_subscribers`.`user_id` = 1 LIMIT 1
INSERT INTO `user_subscribers` (`created_at`, `expire_at`, `purchase`, `updated_at`, `user_id`) VALUES ('2015-03-24 04:43:19', '2015-12-12', 20, '2015-03-24 04:43:19', 1)
---
  def purchase
    user = User.find_by_email_address(params[:email_address])
    subscriber = user.subscriber
    if subscriber.present?
      subscriber.expire_at = params[:expire_at]
      subscriber.purchase = params[:purchase]
      subscriber.save!

SELECT `users`.* FROM `users` WHERE `users`.`email_address` = 'ragupta@gmail.com' LIMIT 1
UPDATE `users` SET `password` = 'New', `updated_at` = '2015-03-24 04:35:48' WHERE `users`.`id` = 1
---
  def reset_password
    if params[:email_address].present? && params[:password].present?
      user = User.find_by_email_address(params[:email_address])
      if user.present?
        user.password = params[:password]
        user.save!

SELECT `users`.* FROM `users` WHERE `users`.`email_address` = 'ragupta@gmail.com' LIMIT 1
---
  def user_detail
    if params[:uuid].present?
      user = User.find_by_uuid(params[:uuid])
      render_json_success user: User.get_user_info(user)
    elsif params[:email_address].present?
      user = User.find_by_email_address(params[:email_address])