app/controllers/addresses_controller.rb

  def create
    @address = Address.new(params[:address])
    if @address.save
---
INSERT INTO `addresses` (`city`, `country`, `created_at`, `landmark`, `latitude`, `longitude`, `merchant_id`, `pincode`, `state`, `street`, `updated_at`) VALUES ('chennai', 'India', '2015-03-24 04:16:49', 'Tamil Nadu', 12.9318069, 80.15908639999999, 1, 600089, 'Tamil Nadu', 'navneetham street', '2015-03-24 04:16:49')