app/controllers/deals_controller.rb

  def create
    @deal = Deal.new(params[:deal])
    if @deal.save
---
INSERT INTO `deals` (`created_at`, `deal_type`, `description`, `discount`, `image1`, `image2`, `image3`, `image4`, `logo_image`, `merchant_id`, `price`, `title`, `updated_at`) VALUES ('2015-03-07 03:52:52', '', 'holi event', '0', 'crooked_river.jpg', 'quiet_place.jpg', 'tree_on_the_bank.jpg', 'union_creek.jpg', 'burney_falls.jpg', 4, 1000, 'B', '2015-03-07 03:52:52')

  def edit
    @deal = Deal.find(params[:id])
---
SELECT `deals`.* FROM `deals` WHERE `deals`.`id` = 3 LIMIT 1

  def update
    @deal = Deal.find(params[:id])
    if @deal.update_attributes(params[:deal])
---
SELECT `deals`.* FROM `deals` WHERE `deals`.`id` = 3 LIMIT 1
UPDATE `deals` SET `logo_image` = 'union_creek.jpg', `updated_at` = '2015-03-07 03:57:42' WHERE `deals`.`id` = 3