app/controllers/merchants_controller.rb

  def index
    @merchants = Merchant.all
---
SELECT `merchants`.* FROM `merchants`

  def show
    @merchant = Merchant.find(params[:id])
---
SELECT `merchants`.* FROM `merchants` WHERE `merchants`.`id` = 1 LIMIT 1

  def create
    @merchant = Merchant.new(params[:merchant])
    if @merchant.save
---
INSERT INTO `merchants` (`created_at`, `email_address`, `merchant_type`, `name`, `updated_at`) VALUES ('2015-03-01 14:17:36', 'somendra@gmail.com', 'pizza', 'Somendra', '2015-03-01 14:17:36')